app/controllers/companies_controller.rb

		    end

    	elsif current_user.role_id == 3 then #企业主
      	@company = Company.find_by_id(current_user.company.id)
---
SELECT * FROM `companies` WHERE (`companies`.`id` = 1)