app/controllers/seo_keywords_controller.rb

SELECT * FROM `seo_companies` WHERE (`seo_companies`.`id` = 23056 AND (updatedat > DATE_SUB(CURDATE(),INTERVAL 6 DAY)))
---
  def load_company
    @company = Company.find(params[:company_id])

SELECT * FROM `seo_keywords` WHERE (`seo_keywords`.company_id = 23056)
SELECT count(*) AS count_all FROM `seo_keywords` WHERE (`seo_keywords`.company_id = 23056)
---
  def index
    @seo_keywords = @company.seo_keywords.find(:all)